Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходнаяНакладная/Ext/ManagerModule.bsl
&НаСервере
Процедура ПечатьНаСервереММ(ТабДок, Объект1) Экспорт
	Контрагент = Объект1.Контрагент;
	НомерДокумента = Объект1.Номер;
	ДатаФормирования = Объект1.Дата;
	
	Макет = Документы.ПриходнаяНакладная.ПолучитьМакет("Макет");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы.Параметры.Дата = Формат(ДатаФормирования, "ДЛФ==DD");
	ОбластьШапкаТаблицы.Параметры.Номер = НомерДокумента;
	ОбластьШапкаТаблицы.Параметры.Контрагент = Контрагент;
	Табдок.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьЗаголовки = Макет.ПолучитьОбласть("Заголовки");
	Табдок.Вывести(ОбластьЗаголовки);
	
	
	Итого = 0;
	Для Каждого Строка из Объект1.Товары Цикл
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрокаТаблицы.Параметры.Заполнить(Строка);
		ОбластьСтрокаТаблицы.Параметры.НомерПП = Строка.НомерСтроки;
		ТабДок.Вывести(ОбластьСтрокаТаблицы);
		Итого = Итого + Строка.Сумма;
	КонецЦикла;
	
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвалТаблицы.Параметры.Итого = Итого;
	Табдок.Вывести(ОбластьПодвалТаблицы);

 КонецПроцедуры
